turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c/atdf/ATSAM4C4C_0.atdf
        <register caption="I/O Drive Register" name="PIO_DRIVER" offset="0x0118" rw="RW" size="4">
          <bitfield caption="Drive of PIO Line 0" mask="0x00000001" name="LINE0" values="PIO_DRIVER__LINE0"/>
          <bitfield caption="Drive of PIO Line 1" mask="0x00000002" name="LINE1" values="PIO_DRIVER__LINE1"/>
          <bitfield caption="Drive of PIO Line 2" mask="0x00000004" name="LINE2" values="PIO_DRIVER__LINE2"/>
          <bitfield caption="Drive of PIO Line 3" mask="0x00000008" name="LINE3" values="PIO_DRIVER__LINE3"/>
          <bitfield caption="Drive of PIO Line 4" mask="0x00000010" name="LINE4" values="PIO_DRIVER__LINE4"/>
          <bitfield caption="Drive of PIO Line 5" mask="0x00000020" name="LINE5" values="PIO_DRIVER__LINE5"/>
          <bitfield caption="Drive of PIO Line 6" mask="0x00000040" name="LINE6" values="PIO_DRIVER__LINE6"/>
          <bitfield caption="Drive of PIO Line 7" mask="0x00000080" name="LINE7" values="PIO_DRIVER__LINE7"/>
          <bitfield caption="Drive of PIO Line 8" mask="0x00000100" name="LINE8" values="PIO_DRIVER__LINE8"/>
          <bitfield caption="Drive of PIO Line 9" mask="0x00000200" name="LINE9" values="PIO_DRIVER__LINE9"/>
          <bitfield caption="Drive of PIO Line 10" mask="0x00000400" name="LINE10" values="PIO_DRIVER__LINE10"/>
          <bitfield caption="Drive of PIO Line 11" mask="0x00000800" name="LINE11" values="PIO_DRIVER__LINE11"/>
          <bitfield caption="Drive of PIO Line 12" mask="0x00001000" name="LINE12" values="PIO_DRIVER__LINE12"/>
          <bitfield caption="Drive of PIO Line 13" mask="0x00002000" name="LINE13" values="PIO_DRIVER__LINE13"/>
          <bitfield caption="Drive of PIO Line 14" mask="0x00004000" name="LINE14" values="PIO_DRIVER__LINE14"/>
          <bitfield caption="Drive of PIO Line 15" mask="0x00008000" name="LINE15" values="PIO_DRIVER__LINE15"/>
          <bitfield caption="Drive of PIO Line 16" mask="0x00010000" name="LINE16" values="PIO_DRIVER__LINE16"/>
          <bitfield caption="Drive of PIO Line 17" mask="0x00020000" name="LINE17" values="PIO_DRIVER__LINE17"/>
          <bitfield caption="Drive of PIO Line 18" mask="0x00040000" name="LINE18" values="PIO_DRIVER__LINE18"/>
          <bitfield caption="Drive of PIO Line 19" mask="0x00080000" name="LINE19" values="PIO_DRIVER__LINE19"/>
          <bitfield caption="Drive of PIO Line 20" mask="0x00100000" name="LINE20" values="PIO_DRIVER__LINE20"/>
          <bitfield caption="Drive of PIO Line 21" mask="0x00200000" name="LINE21" values="PIO_DRIVER__LINE21"/>
          <bitfield caption="Drive of PIO Line 22" mask="0x00400000" name="LINE22" values="PIO_DRIVER__LINE22"/>
          <bitfield caption="Drive of PIO Line 23" mask="0x00800000" name="LINE23" values="PIO_DRIVER__LINE23"/>
          <bitfield caption="Drive of PIO Line 24" mask="0x01000000" name="LINE24" values="PIO_DRIVER__LINE24"/>
          <bitfield caption="Drive of PIO Line 25" mask="0x02000000" name="LINE25" values="PIO_DRIVER__LINE25"/>
          <bitfield caption="Drive of PIO Line 26" mask="0x04000000" name="LINE26" values="PIO_DRIVER__LINE26"/>
          <bitfield caption="Drive of PIO Line 27" mask="0x08000000" name="LINE27" values="PIO_DRIVER__LINE27"/>
          <bitfield caption="Drive of PIO Line 28" mask="0x10000000" name="LINE28" values="PIO_DRIVER__LINE28"/>
          <bitfield caption="Drive of PIO Line 29" mask="0x20000000" name="LINE29" values="PIO_DRIVER__LINE29"/>
          <bitfield caption="Drive of PIO Line 30" mask="0x40000000" name="LINE30" values="PIO_DRIVER__LINE30"/>
          <bitfield caption="Drive of PIO Line 31" mask="0x80000000" name="LINE31" values="PIO_DRIVER__LINE31"/>
        </register>
      </register-group>
      <value-group caption="" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE0">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE1">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE2">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE3">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE4">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE5">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE6">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE7">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE8">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PIO_DRIVER__LINE9">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
